INSERT INTO Teachers (LastName, FirstName, MiddleName, Email) VALUES
                                                                  ('Сидоренко', 'Марина', 'Олександрівна', 'sydorenko@school.edu'),
                                                                  ('Ткаченко', 'Віталій', 'Григорович', 'tkachenko@school.edu'),
                                                                  ('Бондар', 'Наталія', 'Петрівна', 'bondar@school.edu'),
                                                                  ('Литвин', 'Олексій', 'Дмитрович', 'lytvyn@school.edu'),
                                                                  ('Романенко', 'Тетяна', 'Василівна', 'romanenko@school.edu');

INSERT INTO Students (LastName, FirstName, MiddleName, BirthDate) VALUES
                                                                      ('Гончар', 'Микита', 'Сергійович', '2007-01-20'),
                                                                      ('Демченко', 'Аліна', 'Юріївна', '2006-08-12'),
                                                                      ('Захарченко', 'Ілля', 'Богданович', '2007-04-05'),
                                                                      ('Мороз', 'Катерина', 'Олегівна', '2006-10-30'),
                                                                      ('Савченко', 'Данило', 'Іванович', '2007-06-18');

INSERT INTO Subjects (SubjectName, TeacherID) VALUES
                                                  ('Фізика', 4),
                                                  ('Хімія', 5),
                                                  ('Біологія', 6),
                                                  ('Географія', 7),
                                                  ('Англійська мова', 8);

INSERT INTO GradesJournal (StudentID, SubjectID, Grade, GradeDate) VALUES
                                                                       (4, 4, 9, '2024-09-20'),
                                                                       (4, 5, 10, '2024-09-21'),
                                                                       (5, 6, 11, '2024-09-22'),
                                                                       (5, 7, 12, '2024-09-23'),
                                                                       (6, 8, 8, '2024-09-24'),
                                                                       (6, 4, 7, '2024-09-25'),
                                                                       (7, 5, 10, '2024-09-26'),
                                                                       (7, 6, 9, '2024-09-27'),
                                                                       (8, 7, 11, '2024-09-28'),
                                                                       (8, 8, 12, '2024-09-29');
